atmosphere/tutorials/ce3/bubble_62_5m_NO_AMR/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-31.25 -31.25 0)        //0
    (4968.75 -31.25 0)     //1
    (4968.75  9968.75 0)  //2
    (-31.25 9968.75 0)     //3
    (-31.25 -31.25 1000)        //4
    (4968.75 -31.25 1000)     //5
    (4968.75 9968.75 1000)  //6
    (-31.25 9968.75 1000)     //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 160 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
         type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (0 4 5 1)
        );
    }
    left
    {
        type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
         type patch ;//cyclic;
        //neighbourPatch bottom;
        faces
        (
            (1 5 6 2)
        );
    }

    frontandback
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
